<?php

    // filter_var - функція яка фільтрує певне значення, удаляє html символи і нші символи які краще не добавляти у БД;
    // trim - видаляє лишні пробіли із рядка;
   $Log = filter_var(trim($_POST['login3']), FILTER_SANITIZE_STRING); //Фільтруєм як звичайний рядок;

    // filter_var - функція яка фільтрує певне значення, удаляє html символи і нші символи які краще не добавляти у БД;
    // trim - видаляє лишні пробіли із рядка;
    $Pas = filter_var(trim($_POST['parol3']), FILTER_SANITIZE_STRING); //Фільтруєм як звичайний рядок;

    //Хеширования пароля + соль до стовреного пароля
    //Порівнюю хеши паролів у БД для підтвердження входу
    $Pas = md5($Pas."qwertyasdf123");

    //Подключение к БД;
    //mysql[i] -покращена версія;
    $mysql = new mysqli('localhost', 'root', '','register_table');
  
    //Із таблиці 'user_list' у БД я вибираю всі значення по критерію 
    //Where - оператор позволяє вибрати певні дані по пеному критерію
    $Res = $mysql->query("SELECT * FROM `users_list` WHERE `login` = '$Log' AND `password` = '$Pas'");

    //Все получине дание из БД сконвектировать у масив;
    $Usr = $Res->fetch_assoc();

    $alert =  "<script>alert('Не існує такого користувача');</script>";

    if(count($Usr) == 0)
    {
        echo $alert;
        exit();
    }

    //Авторизація через куки
    // time() + 3600 - час життя куки 1 година
    // "/" - на всех сторинках;
    setcookie('user', $Usr['name'], time() + 3600, "/");

    //Закритие БД;
    $mysql->close();

    //На какую страницу переходить 
    // Тут має бути силка на сторінку з вибором майстра, цену..
    header('Location: zapus.php');

?>